///  \brief           Random_Access_Memory_Functions
///
///  \description     Release of Stack
///  \author		    Крепак zorroxied Виталий 016 ФРТК


#include <assert.h>


//------------------------------------------------------------------------------
//------Constants---------------------------------------------------------------



//------------------------------------------------------------------------------
//------My_Types----------------------------------------------------------------

struct RAM_t
	{
		int size_of_memory;
		int size_of_elmnt;

	};
	
//------------------------------------------------------------------------------
//---------Functions_Prototypes-------------------------------------------------

void   RAM_Construct ( RAM_t* Ordering_Memory , int Memory_Size, int Size_of_element );

void        Write_to ( RAM_t* Memory, int Dest_Addr );

double     Read_from ( RAM_t* Memory, int Dest_Addr );

void          Memset ( RAM_t* Memory );

int     Check_Damage ( RAM_t* Memory );
 
void    RAM_Destruct ( RAM_t* Memory );

int      Memory_Dump ( RAM_t* Memory, int With_List_of_Elements );

//------------------------------------------------------------------------------
//------------------------------------------------------------------------------
//------------------------------------------------------------------------------
//------------------------------------------------------------------------------


//------------------------------------------------------------------------------

