// 1:  7, 9, 3
//40: 14, 1, 2 
// 5: 21, 4,40

//Задача - найти обратное отображение
//
// это хэш
// 1:  7, 9, 3 - хэш единички
// представление хэша - список
// без индексации
// как представлять 1 40 5 ?
// 1. Массив - номер ячейки - значение числа
// массив указателей на списки
// list* Array[100] = {}

// заменить этот массив на список!!!!

// читая строчку строим обратную последовательность, для каждого мумбского слова
// заводиться элемент списка(основной), а в подсписок добавляется английское слово

// в элементах списка лежат указатели на строки!

// все прочитанные строки лежат в длинном массиве
